# Домашнее задание «Библиотека Pandas»

### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [91]:
import pandas as pd

In [92]:
ratings_df = pd.read_csv('data/ml-25m/ratings.csv', usecols=['movieId', 'rating'])
ratings_df.head()

   movieId  rating
0      296     5.0
1      306     3.5
2      307     5.0
3      665     5.0
4      899     3.5

In [56]:
movies_df = pd.read_csv('data/ml-25m/movies.csv', usecols=['movieId', 'title'])
movies_df.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [57]:

high_rated_movies = ratings_df.merge(movies_df, on='movieId', how='left') # left join, we don't need not rated movies

high_rated_movies.head()

   movieId  rating                                             title
0      296     5.0                               Pulp Fiction (1994)
1      306     3.5  Three Colors: Red (Trois couleurs: Rouge) (1994)
2      307     5.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)
3      665     5.0                                Underground (1995)
4      899     3.5                        Singin' in the Rain (1952)

In [69]:
max_rated_movie_id = high_rated_movies.groupby('movieId').count()['rating'].index.values.max()
max_rated_movie_id

209171

In [83]:
result_df = high_rated_movies[high_rated_movies['movieId'] == max_rated_movie_id]
movie_title = result_df['title'].values[0]
print(f'Most rated movie is "{movie_title}"')

Most rated movie is "Women of Devil's Island (1962)"

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [85]:
power_df = pd.read_csv('data/power.csv')
power_df.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [109]:
power_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [111]:
power_df.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

In [125]:
country_condition = (power_df['country']=='Latvia') | (power_df['country']=='Lithuania') | (power_df['country']=='Estonia')
category_condition = (power_df['category']==4) | (power_df['category']==12) | (power_df['category']==21)
year_query = '2005 <= year <= 2010'
quantity_query = 'quantity > 0'

filtered_power = power_df[ country_condition & category_condition ].query(year_query).query(quantity_query)

filtered_power.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4

In [132]:
sum_power = filtered_power['quantity'].values.sum()
print(f'Суммарное потребление электроэнергии странами Прибалтики - {sum_power} МВт')

Суммарное потребление электроэнергии странами Прибалтики - 240580.0 МВт

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [141]:
currency_rates_url = 'https://www.exchangerates.org.uk/currency/currency-exchange-rates-table.html'
currency_rates = pd.read_html(currency_rates_url)
len(currency_rates)

1

In [142]:
currency_rate = currency_rates[0]
currency_rate.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25
0,NaN,NaN,NaN,£Click for British Pound exchange rates...GBP,NaN,€Click for Euro exchange rates...EUR,NaN,$Click for US Dollar exchange rates...USD,NaN,¥Click for Japanese Yen exchange rates...JPY,NaN,CHFClick for Swiss Franc exchange rates...CHF,NaN,$Click for Canadian Dollar exchange rates...CAD,NaN,$Click for Australian Dollar exchange rates...AUD,NaN,$Click for New Zealand Dollar exchange rates.....,NaN,₽Click for Russian Rouble exchange rates...RUB,NaN,RClick for South African Rand exchange rates.....,NaN,$Click for Mexican Peso exchange rates...MXN,NaN,Click for United Arab Emirates Dirham exchange...
1,NaN,1 GBP= Inverse:,1.00001.0000,1.00001.0000,1.1670.8569,1.1670.8569,1.39920.7147,1.39920.7147,151.72460.0066,151.72460.0066,1.29280.7735,1.29280.7735,1.75180.5708,1.75180.5708,1.79530.557,1.79530.557,1.93470.5169,1.93470.5169,102.61310.0097,102.61310.0097,20.75590.0482,20.75590.0482,28.81190.0347,28.81190.0347,5.13510.1947,5.13510.1947
2,NaN,1 EUR= Inverse:,0.85691.167,0.85691.167,1.00001.0000,1.00001.0000,1.1990.834,1.1990.834,130.01150.0077,130.01150.0077,1.10780.9027,1.10780.9027,1.50110.6662,1.50110.6662,1.53840.65,1.53840.65,1.65780.6032,1.65780.6032,87.92830.0114,87.92830.0114,17.78550.0562,17.78550.0562,24.68870.0405,24.68870.0405,4.40020.2273,4.40020.2273
3,NaN,1 USD= Inverse:,0.71471.3992,0.71471.3992,0.8341.199,0.8341.199,1.00001.0000,1.00001.0000,108.43550.0092,108.43550.0092,0.9241.0823,0.9241.0823,1.2520.7987,1.2520.7987,1.28310.7794,1.28310.7794,1.38270.7232,1.38270.7232,73.33620.0136,73.33620.0136,14.8340.0674,14.8340.0674,20.59150.0486,20.59150.0486,3.670.2725,3.670.2725
4,NaN,1 JPY= Inverse:,0.0066151.7246,0.0066151.7246,0.0077130.0115,0.0077130.0115,0.0092108.4355,0.0092108.4355,1.00001.0000,1.00001.0000,0.0085117.3602,0.0085117.3602,0.011586.6088,0.011586.6088,0.011884.5104,0.011884.5104,0.012878.4222,0.012878.4222,0.67631.4786,0.67631.4786,0.13687.31,0.13687.31,0.18995.266,0.18995.266,0.033829.5465,0.033829.5465

In [143]:
currency_rate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 26 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       0 non-null      float64
 1   1       12 non-null     object
 2   2       12 non-null     object
 3   3       13 non-null     object
 4   4       12 non-null     object
 5   5       13 non-null     object
 6   6       12 non-null     object
 7   7       13 non-null     object
 8   8       12 non-null     object
 9   9       13 non-null     object
 10  10      12 non-null     object
 11  11      13 non-null     object
 12  12      12 non-null     object
 13  13      13 non-null     object
 14  14      12 non-null     object
 15  15      13 non-null     object
 16  16      12 non-null     object
 17  17      13 non-null     object
 18  18      12 non-null     object
 19  19      13 non-null     object
 20  20      12 non-null     object
 21  21      13 non-null     object
 22  22      12 non-null     object
 23  23      13 non-null     object
 24  24      12 non-null     object
 25  25      13 non-null     object
dtypes: float64(1), object(25)
memory usage: 2.8+ KB